<?xml version="1.0" ?>
<doc>
	<str name="Patent Number">
		EP0115517A1
	</str>

	<str name="Application Number">
		EP1983902601
	</str>

	<str name="Kind Code">
		A1
	</str>

	<str name="Title">
		COMPOSITE PACKAGE AND SOLVENTLESS ASSEMBLY THEREOF
	</str>

	<str name="Abstract">
		Composite package (44), method and apparatus for assembling and using said package. There are commercially available receptacles for packaging an article within a semi-rigid container conforming closely to the shape and size of the article. These containers comprise a container member or bubble with a closure member or lid attached by means of a bonding agent. Typically, the bonding agent is applied by conventional means over substantially the entire surface of at least one side of the closure member. This results in inefficient use of the bonding agent and may prevent the usage of said package in sensitive areas such as packaging of medical related items. The present invention applies a bonding agent (32) to only the portion (24) of the closure (21) that will actually be sealed. This is accomplished by depositing finely divided, electrostatically chargeable bonding agent particles (32) onto the closure member (21), after which said member is juxtaposed with respect to the container member (25) such that the bonding particles (32) overlie the assembly lip (39), after which the bonding agent is heated to thereby adhere both members (21, 25) together. | &#22797;&#21512;&#21253;&#35013;&#65288;44&#65289;&#65292;&#26041;&#27861;&#21450;&#22120;&#20855;&#35013;&#37197;&#21644;&#20351;&#29992;&#35828;&#21253;&#12290;&#26377;&#21830;&#19994;&#21253;&#35013;&#20869;&#30340;&#21322;&#21018;&#24615;&#23481;&#22120;&#31526;&#21512;&#23494;&#20999;&#30340;&#24418;&#29366;&#21644;&#22823;&#23567;&#30340;&#25991;&#31456;&#25991;&#31456;&#20013;&#25552;&#20379;&#30340;&#23481;&#22120;&#12290;&#36825;&#20123;&#23481;&#22120;&#21253;&#25324;&#19982;&#25104;&#21592;&#25110;&#20851;&#38381;&#30340;&#31896;&#25509;&#21058;&#26159;&#25351;&#38468;&#30422;&#23481;&#22120;&#25104;&#21592;&#25110;&#27873;&#27819;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#31896;&#25509;&#21058;&#36866;&#29992;&#20110;&#23545;&#20197;&#20256;&#32479;&#26041;&#24335;&#22823;&#22823;&#33267;&#23569;&#19968;&#20010;&#23553;&#38381;&#30340;&#25104;&#21592;&#26041;&#30340;&#25972;&#20010;&#34920;&#38754;&#12290;&#36825;&#22312;&#31896;&#25509;&#21058;&#21033;&#29992;&#25928;&#29575;&#20302;&#30340;&#32467;&#26524;&#65292;&#24182;&#21487;&#33021;&#38450;&#27490;&#20351;&#29992;&#35828;&#25935;&#24863;&#39046;&#22495;&#30340;&#21253;&#65292;&#20363;&#22914;&#21307;&#30103;&#30456;&#20851;&#29289;&#21697;&#30340;&#21253;&#35013;&#12290;&#26412;&#21457;&#26126;&#36866;&#29992;&#20110;&#19968;&#31896;&#25509;&#21058;&#65288;32&#65289;&#21482;&#65292;&#23553;&#38145;&#65288;21&#65289;&#37096;&#20998;&#65288;24&#65289;&#65292;&#23558;&#23454;&#38469;&#19978;&#34987;&#23553;&#38381;&#12290;&#36825;&#26159;&#36890;&#36807;&#27785;&#31215;&#31934;&#32454;&#20998;&#21106;&#65292;&#38745;&#30005;&#20805;&#30005;&#31896;&#25509;&#21058;&#39063;&#31890;&#65288;32&#21040;&#32467;&#26463;&#30340;&#25104;&#21592;&#65288;21&#65289;&#65292;&#65289;&#20043;&#21518;&#35828;&#65292;&#25104;&#21592;&#30456;&#23545;&#20110;&#23481;&#22120;&#30340;&#25104;&#21592;&#65288;25&#65289;&#65292;&#36825;&#26679;&#65292;&#32467;&#21512;&#31890;&#23376;&#65288;32&#65289;&#24182;&#21015;overlie&#35013;&#37197;&#21767;&#65288;39&#65289;&#65292;&#20854;&#21518;&#65292;&#31896;&#25509;&#21058;&#34987;&#21152;&#28909;&#65292;&#20174;&#32780;&#22362;&#25345;&#30340;&#25104;&#21592;&#65288;21&#65292;25&#65289;&#22312;&#19968;&#36215;&#12290;
	</str>

	<str name="Document Types">
		EP | EPA | DOCDB
	</str>

	<str name="Application Date">
		1983-07-15
	</str>

	<str name="Application Year">
		1983
	</str>

	<str name="Application(Year/Month)">
		1983-07
	</str>

	<str name="Publication Date">
		1984-08-15
	</str>

	<str name="Publication Year">
		1984
	</str>

	<str name="Publication(Year/Month)">
		1984-08
	</str>

	<str name="All IPC">
		B05B5/02 | B05C5/02 | B31F1/00
	</str>

	<str name="IPC Primary">
		B05B5/02
	</str>

	<str name="IPC Section">
		B
	</str>

	<str name="IPC Class">
		B05
	</str>

	<str name="IPC Subclass">
		B05B
	</str>

	<str name="IPC Group">
		B05B5
	</str>

	<str name="Family Members">
		EP0115517A1 | WO1984000705A1
	</str>

	<str name="Family Member Count">
		2
	</str>

	<str name="Family Members Cited By Count">
		4
	</str>

	<str name="Other References">
		See references of WO     8400705A1
	</str>

	<str name="Other References Count">
		1
	</str>

	<str name="Cited By Count">
		0
	</str>

	<str name="Priority Country">
		US
	</str>

	<str name="Priority Number">
		406377
	</str>

	<str name="Priority Date">
		1982-08-09
	</str>

	<str name="Assignee(s)">
		BAXTER TRAVENOL LABORATORIES, INC.
	</str>

	<str name="1st Assignee">
		BAXTER TRAVENOL LABORATORIES, INC.
	</str>

	<str name="Number of Assignees">
		1
	</str>

	<str name="1st Assignee Address">
		
	</str>

	<str name="Assignee(s) Address">
		
	</str>

	<str name="Inventor(s)">
		WHITE, LEONARD, ALAN
	</str>

	<str name="1st Inventor">
		WHITE, LEONARD, ALAN
	</str>

	<str name="Number of Inventors">
		1
	</str>

	<str name="1st Inventor Address">
		
	</str>

	<str name="Inventor(s) Address">
		
	</str>

	<str name="cited by within 3 years">
		0
	</str>

	<str name="cited by within 5 years">
		0
	</str>
</doc>
