<?xml version="1.0" ?>
<doc>
	<str name="Patent Number">
		EP0698680A1
	</str>

	<str name="Application Number">
		EP1994113235
	</str>

	<str name="Kind Code">
		A1
	</str>

	<str name="Title">
		Method for deodorizing and refreshing for dry cleaning and dry cleaning apparatus using such method
	</str>

	<str name="Abstract">
		The present invention provides a method for deodorizing and refreshing petroleum group solvent used in a dry cleaning apparatus, and a dry cleaning apparatus using such a method, which can maintain the circulating solvent in a fresh condition for a long time, eliminate a bad smell of the solvent, provide highly stable cleaning ability and good cleaning finish, and prevent ignition and explosion of the solvent to ensure safety. In the dry cleaning apparatus, the petroleum group solvent in a solvent storage tank 2 is pumped by a circulating pump 5, is supplied to a cleaning bath 8 through a filter 6 and carbon absorbent 7 and then is returned from the cleaning bath 8 to the solvent storage tank 2 through a button trap 3, and an ozone generating device 10 is provided for generating ozone gas and a diffuser 11 for pouring the ozone gas produced by the ozone generating device 10 into the petroleum group solvent as fine bubbles are arranged to be contacted with a bottom surface of the solvent storage tank 2 or the button trap 3. | &#26412;&#21457;&#26126;&#25552;&#20379;&#20102;&#38500;&#33261;&#21644;&#28165;&#26032;&#30340;&#30707;&#27833;&#38598;&#22242;&#28342;&#21058;&#30340;&#24178;&#27927;&#35774;&#22791;&#25152;&#20351;&#29992;&#30340;&#26041;&#27861;&#65292;&#20197;&#21450;&#24178;&#27927;&#35774;&#22791;&#20351;&#29992;&#35813;&#26041;&#27861;&#65292;&#21487;&#20197;&#20445;&#25345;&#22312;&#19968;&#20010;&#26032;&#40092;&#30340;&#24490;&#29615;&#28342;&#21058;&#24456;&#38271;&#19968;&#27573;&#26102;&#38388;&#65292;&#28040;&#38500;&#19981;&#33391;&#27668;&#21619;&#28342;&#21058;&#65292;&#25552;&#20379;&#39640;&#31283;&#23450;&#30340;&#28165;&#27905;&#33021;&#21147;&#20197;&#21450;&#33391;&#22909;&#30340;&#28165;&#27927;&#23436;&#25104;&#65292;&#38450;&#27490;&#28857;&#28779;&#21644;&#28342;&#21058;&#65292;&#20197;&#30830;&#20445;&#23433;&#20840;&#29190;&#28856;&#12290;&#22312;&#24178;&#27927;&#35774;&#22791;&#65292;&#30707;&#27833;&#38598;&#22242;&#28342;&#21058;&#22312;&#28342;&#21058;&#20648;&#32592;&#20108;&#26159;&#30001;&#24490;&#29615;&#27893;5&#25277;&#65292;&#26159;&#36890;&#36807;&#19968;&#20010;&#36807;&#28388;&#22120;&#25552;&#20379;6&#21644;&#30899;&#21560;&#25910;7&#33267;8&#28165;&#27905;&#28020;&#32568;&#65292;&#28982;&#21518;&#20174;&#28165;&#27905;&#28020;8&#36820;&#22238;&#28342;&#21058;&#20648;&#32592;&#36890;&#36807;&#19968;&#20010;&#25353;&#38062;&#38519;&#38449;3&#21644;&#33261;&#27687;&#21457;&#29983;&#35013;&#32622;10 2&#25552;&#20379;&#20135;&#29983;&#33261;&#27687;&#27668;&#20307;&#21644;&#19968;&#20010;&#27975;&#31569;&#30340;&#33261;&#27687;&#27668;&#20307;&#30340;&#33261;&#27687;&#21457;&#29983;&#35013;&#32622;&#20135;&#29983;10&#21040;&#30707;&#27833;&#38598;&#22242;&#30340;&#20248;&#33391;&#27873;&#27819;&#23433;&#25490;&#22312;&#28342;&#21058;&#25193;&#25955;11&#25509;&#35302;&#30340;&#21644;&#28342;&#21058;&#20648;&#32592;2&#25110;&#25353;&#38062;&#38519;&#38449;3&#24213;&#37096;&#34920;&#38754;&#12290;
	</str>

	<str name="Document Types">
		EP | EPA | DOCDB
	</str>

	<str name="Application Date">
		1994-08-24
	</str>

	<str name="Application Year">
		1994
	</str>

	<str name="Application(Year/Month)">
		1994-08
	</str>

	<str name="Publication Date">
		1996-02-28
	</str>

	<str name="Publication Year">
		1996
	</str>

	<str name="Publication(Year/Month)">
		1996-02
	</str>

	<str name="All IPC">
		D06F43/08
	</str>

	<str name="IPC Primary">
		D06F43/08
	</str>

	<str name="IPC Section">
		D
	</str>

	<str name="IPC Class">
		D06
	</str>

	<str name="IPC Subclass">
		D06F
	</str>

	<str name="IPC Group">
		D06F43
	</str>

	<str name="Family Members">
		EP0698680B1 | EP0698680A1 | US5488842 | US5511264
	</str>

	<str name="Family Member Count">
		4
	</str>

	<str name="Family Members Cited By Count">
		31
	</str>

	<str name="Other References">
		DATABASE WPI Section Ch, Week 9427, Derwent Publications Ltd., London, GB; Class F, AN 94-2206628 &amp; JP-A-6 154 478 (NOGUCHI) 3 June 1994 | PATENT ABSTRACTS OF JAPAN vol. 16, no. 265 (C-0951) 16 June 1992 &amp; JP-A-04 064 395 (SHIGEO NAKAMURA) 28 February 1992
	</str>

	<str name="Other References Count">
		2
	</str>

	<str name="Cited By">
		EP1528139A2 | EP1536052A2
	</str>

	<str name="Cited By Count">
		2
	</str>

	<str name="Cites">
		US4277336 | US3291562 | AU473047A | CH416523A | EP0422603A1
	</str>

	<str name="Cites Count">
		5
	</str>

	<str name="Priority Country">
		EP | JP | JP | JP | US
	</str>

	<str name="Priority Number">
		94113235 | 5312394 | 5312494 | 5312594 | 29333894
	</str>

	<str name="Priority Date">
		1994-08-24 | 1994-02-25 | 1994-02-25 | 1994-02-25 | 1994-08-24
	</str>

	<str name="Assignee(s)">
		EBARA CORPORATION
	</str>

	<str name="1st Assignee">
		EBARA CORPORATION
	</str>

	<str name="Number of Assignees">
		1
	</str>

	<str name="1st Assignee Address">
		
	</str>

	<str name="Assignee(s) Address">
		
	</str>

	<str name="Inventor(s)">
		NISHIOKA, YUKIKO | KAMIYA, ICHIRO | SHINJYO, RYOUICHI | ISHII, YOSHIHIRO | KOUSAKA, KOUICHI
	</str>

	<str name="1st Inventor">
		NISHIOKA, YUKIKO
	</str>

	<str name="Number of Inventors">
		5
	</str>

	<str name="1st Inventor Address">
		
	</str>

	<str name="Inventor(s) Address">
		
	</str>

	<str name="cited by within 3 years">
		0
	</str>

	<str name="cited by within 5 years">
		0
	</str>
</doc>
