<?xml version="1.0" ?>
<doc>
	<str name="Patent Number">
		EP1129250A1
	</str>

	<str name="Application Number">
		EP1998953086
	</str>

	<str name="Kind Code">
		A1
	</str>

	<str name="Title">
		A WASHING MACHINE EQUIPPED WITH AN AIR BUBBLE GENERATOR HAVING CONTRACTION/ENLARGEMENT EXHAUST NOZZLES
	</str>

	<str name="Abstract">
		Outlets of a contraction/enlargement exhaust nozzle type are formed in an air bubble-generating plate (100) from which fine air bubles are generated. The outlets (200, 300) are constituted with outer outlets and inner outlets. The outer outlets are formed along edge portions of the air bubble-generating plate and the inner outlets are formed in the inner portions of the air bubble-generating plate. Each of the outlets has a flow-in portion, a contraction portion, and a flow-out portion which are aligned in a coaxial line and have different diameters, so that each of the outlets are formed in a shape of a contraction/enlargement exhaust nozzle type. A diameter of the flow-out portion is smaller than a diameter of the flow-in portion, but larger than a diameter of the contraction portion. A height of the contraction portion is larger than a height of the flow-out portion, but smaller than a height of the flow-in portion. The diameters of contraction portions of the outer outlets are smaller than those of contraction portions of the inner outlets. Fine air bubbles are generated from an air bubble generator having outlets of a contraction/enlargement exhaust nozzle type. | &#32593;&#28857;&#30340;&#25910;&#32553;/&#25193;&#24352;&#25490;&#27668;&#21943;&#31649;&#22411;&#27491;&#22788;&#22312;&#19968;&#20010;&#27668;&#27873;&#24418;&#25104;&#30340;&#21457;&#30005;&#26495;&#65288;100&#65289;&#30340;&#32602;&#27454;&#31354;&#27668;bubles&#20135;&#29983;&#12290;&#36825;&#20123;&#26381;&#21153;&#32593;&#28857;&#65288;200&#65292;300&#65289;&#26159;&#33258;&#22806;&#32593;&#28857;&#21644;&#20869;&#21457;&#21806;&#12290;&#22806;&#23618;&#30340;&#24215;&#38138;&#24418;&#25104;&#20102;&#27839;&#36793;&#32536;&#37096;&#20998;&#20135;&#29983;&#30340;&#27668;&#27873;&#26495;&#21644;&#20869;&#37096;&#30340;&#24215;&#38138;&#22312;&#27668;&#27873;&#20869;&#37096;&#20998;&#21457;&#30005;&#26495;&#32452;&#25104;&#12290;&#35813;&#24215;&#38138;&#37117;&#26377;&#19968;&#20010;&#27969;&#21160;&#30340;&#19968;&#37096;&#20998;&#65292;&#25910;&#32553;&#37096;&#20998;&#65292;&#24182;&#27969;&#20986;&#37096;&#20998;&#30340;&#25490;&#21015;&#22312;&#19968;&#21516;&#36724;&#32447;&#65292;&#20855;&#26377;&#19981;&#21516;&#30340;&#30452;&#24452;&#65292;&#22909;&#35753;&#27599;&#38388;&#20998;&#24215;&#30340;&#25104;&#31435;&#26159;&#19968;&#20010;&#24418;&#29366;&#25910;&#32553;/&#25193;&#24352;&#25490;&#27668;&#21943;&#22068;&#31867;&#22411;&#12290; 1&#65292;&#27969;&#24452;&#20986;&#37096;&#20221;&#27604;1&#30340;&#27969;&#37327;&#22312;&#37096;&#20998;&#30452;&#24452;&#36739;&#23567;&#65292;&#20294;&#27604;1&#30340;&#25910;&#32553;&#37096;&#20998;&#30340;&#30452;&#24452;&#22823;&#12290;&#19968;&#20010;&#25910;&#32553;&#37096;&#20998;&#30340;&#39640;&#24230;&#22823;&#20110;1&#30340;&#27969;&#37327;&#39640;&#24230;&#20986;&#19968;&#37096;&#20998;&#65292;&#20294;&#27604;1&#30340;&#27969;&#37327;&#39640;&#24230;&#36739;&#23567;&#30340;&#37096;&#20998;&#12290;&#23545;&#24215;&#22806;&#25910;&#32553;&#37096;&#20998;&#30340;&#30452;&#24452;&#23567;&#20110;&#24215;&#38138;&#20869;&#30340;&#37096;&#20998;&#30340;&#25910;&#32553;&#12290;&#32454;&#27668;&#27873;&#20135;&#29983;&#30340;&#27668;&#27873;&#20855;&#26377;&#25910;&#32553;/&#25193;&#24352;&#25490;&#27668;&#21943;&#31649;&#24335;&#25554;&#24231;&#21457;&#30005;&#26426;&#12290;
	</str>

	<str name="Document Types">
		EP | EPA | DOCDB
	</str>

	<str name="Application Date">
		1998-11-10
	</str>

	<str name="Application Year">
		1998
	</str>

	<str name="Application(Year/Month)">
		1998-11
	</str>

	<str name="Publication Date">
		2001-09-05
	</str>

	<str name="Publication Year">
		2001
	</str>

	<str name="Publication(Year/Month)">
		2001-09
	</str>

	<str name="All IPC">
		D06F39/00
	</str>

	<str name="IPC Primary">
		D06F39/00
	</str>

	<str name="IPC Section">
		D
	</str>

	<str name="IPC Class">
		D06
	</str>

	<str name="IPC Subclass">
		D06F
	</str>

	<str name="IPC Group">
		D06F39
	</str>

	<str name="Family Members">
		EP1129250A1 | EP1129250B1 | DE69818716T2 | WO2000028129A1 | ES2209215T3 | CN1327494A | DE69818716D1 | CN1167843C
	</str>

	<str name="Family Member Count">
		8
	</str>

	<str name="Family Members Cited By Count">
		0
	</str>

	<str name="Other References">
		See references of WO     0028129A1
	</str>

	<str name="Other References Count">
		1
	</str>

	<str name="Cited By Count">
		0
	</str>

	<str name="Priority Country">
		KR
	</str>

	<str name="Priority Number">
		9800359
	</str>

	<str name="Priority Date">
		1998-11-10
	</str>

	<str name="Assignee(s)">
		DAEWOO ELECTRONICS CO., LTD | DAEWOO ELECTRONICS CORPORATION
	</str>

	<str name="1st Assignee">
		DAEWOO ELECTRONICS CO., LTD
	</str>

	<str name="Number of Assignees">
		2
	</str>

	<str name="1st Assignee Address">
		
	</str>

	<str name="Assignee(s) Address">
		
	</str>

	<str name="Inventor(s)">
		HONG, DAE-YEONG | LIM, MOO-SAENG
	</str>

	<str name="1st Inventor">
		HONG, DAE-YEONG
	</str>

	<str name="Number of Inventors">
		2
	</str>

	<str name="1st Inventor Address">
		
	</str>

	<str name="Inventor(s) Address">
		
	</str>

	<str name="cited by within 3 years">
		0
	</str>

	<str name="cited by within 5 years">
		0
	</str>
</doc>
